<a href="https://colab.research.google.com/github/dipucriodigital/engenharia-de-software/blob/main/banco-de-dados/BD_Aula1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Banco de Dados - Prof. Sérgio Lifschitz

---

## Exercícios da Aula 1: Introdução à Linguagem SQL DML (consultas)


---


ANTES de começar,  ❗ **não esquecer** ❗ de, antes de mais nada, SALVAR este notebook no ambiente COLAB no drive da tua própria conta GOOGLE.

## PASSO 1: Instalação e Configuração do PostgreSQL

Basta dar PLAY que o script abaixo instalará o SGBD PostgreSQL

In [ ]:
# %%capture
# Instalação do PostgreSQL
!sudo apt-get -y -qq update
!pip install sqlalchemy==1.4.47
!sudo apt-get -y -qq install postgresql
!sudo service postgresql start
# Alterando a senha do usuário padrão 'postgres' para 'postgres'
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76, <> line 10.)
debconf: falling back to frontend: Readline
debconf: unable to initialize frontend: Readline
debconf: (This frontend requires a controlling tty.)
debconf: falling back to frontend: Teletype
dpkg-preconfigure: unable to re-open stdin:
Selecting previously unselected package cron.
(Reading database ... 128285 files and directories currently installed.)
Preparing to unpack .../0-cron_3.0pl1-136ubuntu1_amd64.deb ...
Unpacking cron (3.0pl1-136ubuntu1) ...
Selecting previously unselected package logrotate.
Preparing to unpack .../1-logrotate_3.14.0-4ubuntu3_amd64.deb ...
Unpacking logrotate (3.14.0-4ubuntu3) ...
Selecting previously unselected package netbase.
Preparing to unpack .../2-netbase_6.1_all.deb ...
Unpacking netbase (6.1) ...
Selecting previously unselected package postgresql-client-common.
Preparing to unpack .../3-postgresql-client-common_214ubuntu0.1_all.deb ...
Unpacking postgresql-client-common (214ubuntu0.1) ...
Selecting previously unselected package postgresql-client-12.
Preparing to unpack .../4-postgresql-client-12_12.14-0ubuntu0.20.04.1_amd64.deb ...
Unpacking postgresql-client-12 (12.14-0ubuntu0.20.04.1) ...
Selecting previously unselected package ssl-cert.
Preparing to unpack .../5-ssl-cert_1.0.39_all.deb ...
Unpacking ssl-cert (1.0.39) ...
Selecting previously unselected package postgresql-common.
Preparing to unpack .../6-postgresql-common_214ubuntu0.1_all.deb ...
Adding 'diversion of /usr/bin/pg_config to /usr/bin/pg_config.libpq-dev by postgresql-common'
Unpacking postgresql-common (214ubuntu0.1) ...
Selecting previously unselected package postgresql-12.
Preparing to unpack .../7-postgresql-12_12.14-0ubuntu0.20.04.1_amd64.deb ...
Unpacking postgresql-12 (12.14-0ubuntu0.20.04.1) ...
Selecting previously unselected package postgresql.
Preparing to unpack .../8-postgresql_12+214ubuntu0.1_all.deb ...
Unpacking postgresql (12+214ubuntu0.1) ...
Selecting previously unselected package sysstat.
Preparing to unpack .../9-sysstat_12.2.0-2ubuntu0.2_amd64.deb ...
Unpacking sysstat (12.2.0-2ubuntu0.2) ...
Setting up logrotate (3.14.0-4ubuntu3) ...
Created symlink /etc/systemd/system/timers.target.wants/logrotate.timer → /lib/systemd/system/logrotate.timer.
Setting up cron (3.0pl1-136ubuntu1) ...
Adding group `crontab' (GID 113) ...
Done.
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Created symlink /etc/systemd/system/multi-user.target.wants/cron.service → /lib/systemd/system/cron.service.
Setting up ssl-cert (1.0.39) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline
Setting up netbase (6.1) ...
Setting up sysstat (12.2.0-2ubuntu0.2) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline

Creating config file /etc/default/sysstat with new version
update-alternatives: using /usr/bin/sar.sysstat to provide /usr/bin/sar (sar) in auto mode
Created symlink /etc/systemd/system/multi-user.target.wants/sysstat.service → /lib/systemd/system/sysstat.service.
Setting up postgresql-client-common (214ubuntu0.1) ...
Setting up postgresql-client-12 (12.14-0ubuntu0.20.04.1) ...
update-alternatives: using /usr/share/postgresql/12/man/man1/psql.1.gz to provide /usr/share/man/man1/psql.1.gz (psql.1.gz) in auto mode
Setting up postgresql-common (214ubuntu0.1) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline
Adding user postgres to group ssl-cert

Creating config file /etc/postgresql-common/createcluster.conf with new version
Building PostgreSQL dictionaries from installed myspell/hunspell packages...
  en_us
Removing obsolete dictionary files:
Created symlink /etc/systemd/system/multi-user.target.wants/postgresql.service → /lib/systemd/system/postgresql.service.
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up postgresql-12 (12.14-0ubuntu0.20.04.1) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline
Creating new PostgreSQL cluster 12/main ...
/usr/lib/postgresql/12/bin/initdb -D /var/lib/postgresql/12/main --auth-local peer --auth-host md5
The files belonging to this database system will be owned by user "postgres".
This user must also own the server process.

The database cluster will be initialized with locale "en_US.UTF-8".
The default database encoding has accordingly been set to "UTF8".
The default text search configuration will be set to "english".

Data page checksums are disabled.

fixing permissions on existing directory /var/lib/postgresql/12/main ... ok
creating subdirectories ... ok
selecting dynamic shared memory implementation ... posix
selecting default max_connections ... 100
selecting default shared_buffers ... 128MB
selecting default time zone ... Etc/UTC
creating configuration files ... ok
running bootstrap script ... ok
performing post-bootstrap initialization ... ok
syncing data to disk ... ok

Success. You can now start the database server using:

    pg_ctlcluster 12 main start

Ver Cluster Port Status Owner    Data directory              Log file
12  main    5432 down   postgres /var/lib/postgresql/12/main /var/log/postgresql/postgresql-12-main.log
update-alternatives: using /usr/share/postgresql/12/man/man1/postmaster.1.gz to provide /usr/share/man/man1/postmaster.1.gz (postmaster.1.gz) in auto mode
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up postgresql (12+214ubuntu0.1) ...
Processing triggers for man-db (2.9.1-1) ...
Processing triggers for systemd (245.4-4ubuntu3.20) ...
 * Starting PostgreSQL 12 database server
   ...done.
ALTER ROLE

## PASSO 2: Preparo do Esquema Relacional CARROS 

Por favor, basta dar PLAY aqui também pois a criação de esquemas relacionais é assunto da AULA 2. Os scripts (programas) abaixo preparam o ambiente (Esquema e Instância de testes) para realizar consultas SQL no seu próprio  COLAB.

Baixe o esquema no seguinte link: https://drive.google.com/file/d/1pjKbGImerDoBxRCUTuus-Mg652m9hhQJ/view?usp=sharing

Coloque o esquema na pasta padrão do seu Google Drive e siga as instruções abaixo.

In [ ]:
# [2.1] Monta o diretório do Google Drive no seu Colab
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
# [2.2] Cria o esquema no banco de dados no Colab
# %%capture
!sudo -u postgres psql -U postgres -c 'DROP SCHEMA IF EXISTS carros CASCADE;'
!sudo -u postgres psql -U postgres -c 'CREATE SCHEMA carros;'
!PGPASSWORD='postgres' psql -h localhost -U postgres -d postgres -a -f drive/MyDrive/esquema_carros.sql

NOTICE:  schema "carros" does not exist, skipping
DROP SCHEMA
CREATE SCHEMA
SET SCHEMA 'carros';
SET
CREATE TABLE carros.automoveis (
    codigo integer NOT NULL,
    ano character(2) NOT NULL,
    fabricante character(20),
    modelo character(20),
    preco_tabela numeric(8,2),
    pais character(20)
);
CREATE TABLE
CREATE TABLE carros.consumidores (
    cpf character(12) NOT NULL,
    nome character(15),
    sobrenome character(15),
    cidade character(25),
    estado character(2)
);
CREATE TABLE
CREATE TABLE carros.garagens (
    codigo integer NOT NULL,
    ano character(2) NOT NULL,
    cgc integer NOT NULL,
    quantidade integer
);
CREATE TABLE
CREATE TABLE carros.negocios (
    codigo integer NOT NULL,
    ano character(2) NOT NULL,
    cgc integer NOT NULL,
    cpf character(12) NOT NULL,
    data date,
    preco numeric(8,2)
);
CREATE TABLE
CREATE TABLE carros.revendedoras (
    cgc integer NOT NULL,
    nome character(20),
    estado character(2),
    cidade character(25),
    proprietario character(12)
);
CREATE TABLE
CREATE FUNCTION carros.conta(cgc_in integer, ano_in character) RETURNS integer
    LANGUAGE plpgsql
    AS $$
DECLARE
    total integer;
BEGIN
    select sum(quantidade) into total
    from garagens g where g.cgc = cgc_in and g.ano = ano_in;
    return total;
END;
$$;
CREATE FUNCTION
CREATE FUNCTION carros.increment(i integer) RETURNS integer
    LANGUAGE plpgsql
    AS $$
        BEGIN
                RETURN i + 1;
        END;
$$;
CREATE FUNCTION
CREATE FUNCTION carros.tem_estoque() RETURNS trigger
    LANGUAGE plpgsql
    AS $$
DECLARE
    qtd integer;
BEGIN
    qtd:=0;
    select quantidade into qtd from garagens g
    where g.cgc = New.cgc and g.codigo = New.codigo and g.ano = New.ano;
    RAISE INFO 'qtd=%', qtd;
    if (qtd<=0) or qtd is NULL then
        RAISE EXCEPTION 'Nao tem o carro % - ano % em estoque', NEW.codigo, NEW.ano;
    RETURN NULL;
    end if;
    RETURN NEW;
END;
$$;
CREATE FUNCTION
INSERT INTO carros.automoveis VALUES (1022, '85', 'Ford                ', 'Del Rey             ', 4800.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1051, '88', 'Fiat                ', 'Elba                ', 6200.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1051, '89', 'Fiat                ', 'Elba                ', 7600.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '87', 'Ford                ', 'Escort              ', 7000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '88', 'Ford                ', 'Escort              ', 7800.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1013, '95', 'Volkswagen          ', 'Kombi               ', 12000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1061, '94', 'General Motors      ', 'Monza               ', 18000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1014, '95', 'Volkswagen          ', 'Parati              ', 15200.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1071, '93', 'Gurgel              ', 'BR800               ', 6500.00, 'Brasil              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1081, '90', 'Honda               ', 'Accord              ', 37000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1281, '94', 'Hyundai             ', 'Excel               ', 19500.00, 'Coreia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1101, '92', 'Lada                ', 'Laika               ', 5500.00, 'Russia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1101, '93', 'Lada                ', 'Laika               ', 6200.00, 'Russia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1052, '93', 'Fiat                ', 'Tempra              ', 18800.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1111, '95', 'Suzuki              ', 'Sidekick            ', 36000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1102, '92', 'Lada                ', 'Niva                ', 7800.00, 'Russia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1071, '94', 'Gurgel              ', 'BR800               ', 7500.00, 'Brasil              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1131, '95', 'Peugeot             ', '205                 ', 11400.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1053, '95', 'Fiat                ', 'Tipo                ', 13000.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1082, '95', 'Honda               ', 'Civic               ', 22870.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1141, '95', 'Audi                ', '80                  ', 52000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1142, '95', 'Audi                ', '100                 ', 60000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1151, '95', 'BMW                 ', '318                 ', 51000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1011, '90', 'Volkswagen          ', 'Apollo              ', 9000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1011, '92', 'Volkswagen          ', 'Apollo              ', 10600.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1014, '94', 'Volkswagen          ', 'Parati              ', 12400.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1061, '88', 'General Motors      ', 'Monza               ', 7500.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1052, '94', 'Fiat                ', 'Tempra              ', 20500.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '89', 'Ford                ', 'Escort              ', 8300.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1051, '90', 'Fiat                ', 'Elba                ', 10800.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '90', 'Ford                ', 'Escort              ', 9000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1021, '89', 'Ford                ', 'Belina              ', 8800.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1033, '95', 'Chevrolet           ', 'Corsa GL            ', 11950.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1011, '93', 'Volkswagen          ', 'Apollo              ', 11100.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1052, '95', 'Fiat                ', 'Tempra              ', 34000.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1161, '95', 'Volvo               ', '460                 ', 40000.00, 'Suecia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1171, '95', 'Daihatsu            ', 'Charade             ', 20000.00, 'Coreia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1181, '95', 'Porsche             ', '938 GTS             ', 180000.00, 'UK                  ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1132, '95', 'Peugeot             ', '405                 ', 30000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1133, '95', 'Peugeot             ', '605                 ', 55000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1282, '95', 'Hyundai             ', 'Elantra             ', 27000.00, 'Coreia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1162, '95', 'Volvo               ', '850                 ', 70000.00, 'Suecia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1191, '95', 'Mercedez Benz       ', 'C200                ', 60000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1122, '95', 'Renault             ', '19                  ', 25000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1022, '86', 'Ford                ', 'Del Rey             ', 6000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '92', 'Ford                ', 'Escort              ', 9700.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '93', 'Ford                ', 'Escort              ', 10800.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1051, '95', 'Fiat                ', 'Elba                ', 18300.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1061, '89', 'General Motors      ', 'Monza               ', 9800.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1103, '92', 'Lada                ', 'Samara              ', 8000.00, 'Russia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1152, '95', 'BMW                 ', '325                 ', 68000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1153, '95', 'BMW                 ', '530                 ', 93000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1201, '95', 'Ferrari             ', '512                 ', 330000.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1211, '95', 'Land Rover          ', 'Defender            ', 35000.00, 'Inglaterra          ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1221, '95', 'Mitsubishi          ', 'Pajero              ', 45000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1231, '95', 'Mazda               ', '626                 ', 36000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1123, '95', 'Renault             ', 'Nevada              ', 27000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1241, '95', 'Rolls Royce         ', 'Corniche            ', 499000.00, 'Inglaterra          ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1112, '95', 'Suzuki              ', 'Canvas              ', 15000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1192, '95', 'Mercedez Benz       ', 'C280                ', 70000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1251, '95', 'Toyota              ', 'Paseo               ', 35000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1043, '95', 'Citroen             ', 'ZX                  ', 30000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1021, '88', 'Ford                ', 'Belina              ', 8000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1104, '92', 'Lada                ', 'Pantanal            ', 8500.00, 'Russia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '91', 'Ford                ', 'Escort              ', 14400.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1032, '92', 'Chevrolet           ', 'Chevette            ', 7200.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1081, '95', 'Honda               ', 'Accord              ', 48000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1022, '87', 'Ford                ', 'Del Rey             ', 7000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1012, '90', 'Volkswagen          ', 'Gol                 ', 7300.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1012, '92', 'Volkswagen          ', 'Gol                 ', 8000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1012, '94', 'Volkswagen          ', 'Gol                 ', 9300.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1031, '95', 'Chevrolet           ', 'Corsa Wind          ', 7350.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1051, '93', 'Fiat                ', 'Elba                ', 12600.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1261, '95', 'Nissan              ', 'Sentra              ', 38000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1113, '95', 'Suzuki              ', 'Vitara              ', 25000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1222, '95', 'Mitsubishi          ', 'Galant              ', 40000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1154, '95', 'BMW                 ', '840                 ', 147000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1232, '95', 'Mazda               ', 'MX                  ', 32000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1252, '95', 'Toyota              ', 'Corolla             ', 38000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1014, '93', 'Volkswagen          ', 'Parati              ', 10800.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1081, '93', 'Honda               ', 'Accord              ', 40000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1061, '93', 'General Motors      ', 'Monza               ', 16000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1061, '90', 'General Motors      ', 'Monza               ', 11000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1014, '90', 'Volkswagen          ', 'Parati              ', 8800.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1044, '95', 'Citroen             ', 'XM                  ', 65000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1124, '95', 'Renault             ', '21                  ', 29000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1202, '95', 'Ferrari             ', '348                 ', 215000.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1233, '95', 'Mazda               ', 'Protege             ', 26000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1262, '95', 'Nissan              ', 'Pathfinder          ', 43000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1182, '95', 'Porsche             ', '921 Carrera         ', 140000.00, 'Inglaterra          ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1271, '95', 'Daewoo              ', 'Espero              ', 23000.00, 'Coreia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1041, '94', 'Citroen             ', 'AX                  ', 21000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1021, '87', 'Ford                ', 'Belina              ', 5700.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1212, '95', 'Land Rover          ', 'Discovery           ', 63000.00, 'Inglaterra          ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1114, '95', 'Suzuki              ', 'Swift               ', 20000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1193, '95', 'Mercedes Benz       ', 'E280                ', 85000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1172, '95', 'Daihatsu            ', 'Feroza              ', 28000.00, 'Coreia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1253, '95', 'Toyota              ', 'Previa              ', 68000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1194, '95', 'Mercedes Benz       ', 'S500                ', 170000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1223, '95', 'Mitsubishi          ', 'Lancer              ', 29000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1022, '89', 'Ford                ', 'Del Rey             ', 9300.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '94', 'Ford                ', 'Escort              ', 12500.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1014, '92', 'Volkswagen          ', 'Parati              ', 9800.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1254, '95', 'Toyota              ', 'Hilux               ', 52000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1115, '95', 'Suzuki              ', 'Samurai             ', 18000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1083, '95', 'Honda               ', 'Legend              ', 90000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (99000, '02', 'Renault             ', 'Twingo              ', 11890.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1032, '93', 'Chevrolet           ', 'Chevette            ', 7900.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1032, '89', 'Chevrolet           ', 'Chevette            ', 7000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1032, '87', 'Chevrolet           ', 'Chevette            ', 6000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1032, '84', 'Chevrolet           ', 'Chevette            ', 4300.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1012, '93', 'Volkswagen          ', 'Gol                 ', 8600.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1012, '95', 'Volkswagen          ', 'Gol                 ', 10500.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1041, '95', 'Citroen             ', 'AX                  ', 25000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (99001, '02', 'Citroen             ', 'C5                  ', 16000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (88374, '99', 'Jac                 ', 'J3                  ', 4800.00, 'Brasil              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (957798, '02', 'Ford                ', 'Fiesta              ', 100000.00, 'Brasil              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1300, '17', 'Fiat                ', 'Uno 2016            ', 50000.00, 'Brasil              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1042, '19', 'Citroen             ', 'Xantia              ', 46000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1121, '95', 'Renault             ', 'Twin                ', 11322.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1020, '85', 'Ford                ', 'Del Rey             ', 4105.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1306, '20', 'Suzuki              ', 'Jimmy               ', 66288.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1308, '20', 'Peugeot             ', '2008                ', 65817.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (101, '89', 'Ford                ', 'Ka                  ', 50.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (100, '90', 'Ford                ', 'Ka                  ', 100.00, 'EUA                 ');
INSERT 0 1

## PASSO 3: Preparando para usar o SGBD PostgreSQL localmente

In [ ]:
# Configurando o PostgreSQL na variável de ambiente DATABASE_URL
%env DATABASE_URL=postgresql://postgres:postgres@localhost:5432/postgres

env: DATABASE_URL=postgresql://postgres:postgres@localhost:5432/postgres

In [ ]:
# Carregando a extensão sql para usar o SQL pelo Google Colab
%load_ext sql

## Lista de Exercícios para prática de SQL 

Consultas simples sobre o esquema CARROS implantado no SGBD PostgreSQL

### Esquema relacional da base de dados Carros:

<img src='https://drive.google.com/uc?export=view&id=1pIB4LORRz4J2gwEjM_qxwVYHDlqXGg5Y'>

Chaves primárias sublinhadas e chaves estrangeiras em itálico.

In [ ]:
%sql postgresql://postgres:postgres@localhost:5432/postgres

In [ ]:
# Escolhe o esquema carros como o esquema em que serão feitas as consultas
# (deve-se executar essa célula sempre que for trocar para o esquema carros)
%%sql
SET SCHEMA 'carros';

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

### Exemplo de consulta:

## 1. Quais automóveis italianos na base de dados?

Para rodar a consulta em SQL abaixo, basta dar PLAY nesta célula!
Se quiser, pode mudar o país e verificar as respostas (instâncias!) distintas.

In [ ]:
%%sql
 
SELECT * 
FROM automoveis 
WHERE pais = 'Italia';

 * postgresql://postgres:***@localhost:5432/postgres
11 rows affected.

[(1051, '88', 'Fiat                ', 'Elba                ', Decimal('6200.00'), 'Italia              '),
 (1051, '89', 'Fiat                ', 'Elba                ', Decimal('7600.00'), 'Italia              '),
 (1052, '93', 'Fiat                ', 'Tempra              ', Decimal('18800.00'), 'Italia              '),
 (1053, '95', 'Fiat                ', 'Tipo                ', Decimal('13000.00'), 'Italia              '),
 (1052, '94', 'Fiat                ', 'Tempra              ', Decimal('20500.00'), 'Italia              '),
 (1051, '90', 'Fiat                ', 'Elba                ', Decimal('10800.00'), 'Italia              '),
 (1052, '95', 'Fiat                ', 'Tempra              ', Decimal('34000.00'), 'Italia              '),
 (1051, '95', 'Fiat                ', 'Elba                ', Decimal('18300.00'), 'Italia              '),
 (1201, '95', 'Ferrari             ', '512                 ', Decimal('330000.00'), 'Italia              '),
 (1051, '93', 'Fiat                ', 'Elba                ', Decimal('12600.00'), 'Italia              '),
 (1202, '95', 'Ferrari             ', '348                 ', Decimal('215000.00'), 'Italia              ')]

---

Tente agora definir as seguintes consultas em SQL. Após o último exercício, disponibilizamos algumas soluções propostas para simples conferência.

## 2. Listar os nomes dos fabricantes dos automóveis na base de dados e os respectivos países de origem.

In [ ]:
%%sql

UsageError: %%sql is a cell magic, but the cell body is empty. Did you mean the line magic %sql (single %)?

## 3. Listar os nomes das pessoas que são potenciais compradoras de automóveis, moradoras do estado do Rio de Janeiro, e que também sejam proprietárias de revendedoras

In [ ]:
%%sql

UsageError: %%sql is a cell magic, but the cell body is empty. Did you mean the line magic %sql (single %)?

## 4. Quais revendedoras presentes nos estados da Bahia e Pernambuco?

In [ ]:
%%sql

## 5. Quais são os automóveis no banco de dados, com valor tabelado superior a 120 mil reais, que ainda não foram comprados por consumidor algum?

In [ ]:
%%sql

## 6. Quais revendedoras (CGC) têm para vender automóveis dos anos 88 e 89?.

In [ ]:
%%sql

# Seguem, abaixo, as células com as consultas resolvidas! 


---


❗**NÃO OLHAR ANTES de TENTAR FAZER** ❗

## 2. Listar os nomes dos fabricantes dos automóveis na base de dados e os respectivos países de origem.

In [ ]:
%%sql

SELECT DISTINCT Fabricante, Pais
FROM Automoveis
ORDER BY Fabricante

 * postgresql://postgres:***@localhost:5432/postgres
32 rows affected.

[('Audi                ', 'Alemanha            '),
 ('BMW                 ', 'Alemanha            '),
 ('Chevrolet           ', 'EUA                 '),
 ('Citroen             ', 'Franca              '),
 ('Daewoo              ', 'Coreia              '),
 ('Daihatsu            ', 'Coreia              '),
 ('Ferrari             ', 'Italia              '),
 ('Fiat                ', 'Italia              '),
 ('Fiat                ', 'Brasil              '),
 ('Ford                ', 'Brasil              '),
 ('Ford                ', 'EUA                 '),
 ('General Motors      ', 'EUA                 '),
 ('Gurgel              ', 'Brasil              '),
 ('Honda               ', 'Japao               '),
 ('Hyundai             ', 'Coreia              '),
 ('Jac                 ', 'Brasil              '),
 ('Lada                ', 'Russia              '),
 ('Land Rover          ', 'Inglaterra          '),
 ('Mazda               ', 'Japao               '),
 ('Mercedes Benz       ', 'Alemanha            '),
 ('Mercedez Benz       ', 'Alemanha            '),
 ('Mitsubishi          ', 'Japao               '),
 ('Nissan              ', 'Japao               '),
 ('Peugeot             ', 'Franca              '),
 ('Porsche             ', 'UK                  '),
 ('Porsche             ', 'Inglaterra          '),
 ('Renault             ', 'Franca              '),
 ('Rolls Royce         ', 'Inglaterra          '),
 ('Suzuki              ', 'Japao               '),
 ('Toyota              ', 'Japao               '),
 ('Volkswagen          ', 'Alemanha            '),
 ('Volvo               ', 'Suecia              ')]

## 3. Listar os nomes das pessoas que são potenciais compradoras de automóveis, moradoras do estado do Rio de Janeiro, e que também sejam proprietárias de revendedoras

In [ ]:
%%sql

SELECT CPF, Nome
FROM Consumidores
WHERE Estado = 'RJ'
AND CPF IN
(SELECT proprietario FROM revendedoras)

 * postgresql://postgres:***@localhost:5432/postgres
8 rows affected.

[('8999-9      ', 'Paulo          '),
 ('7451-1      ', 'Marcos         '),
 ('6228-8      ', 'Benedita       '),
 ('8981-1      ', 'Gilberto       '),
 ('5698-8      ', 'Romario        '),
 ('6565-5      ', 'Claudio        '),
 ('6568-8      ', 'Caetano        '),
 ('8745-5      ', 'Vera           ')]

## 4. Quais revendedoras presentes nos estados da Bahia e Pernambuco?

In [ ]:
%%sql

SELECT CGC, Nome
FROM Revendedoras
WHERE Estado = 'BA'
OR Estado = 'PE'
ORDER BY Estado

 * postgresql://postgres:***@localhost:5432/postgres
11 rows affected.

[(10030, 'Bahia Veiculos      '),
 (10100, 'Self Car            '),
 (10020, 'Courcelles          '),
 (10540, 'Superauto           '),
 (10610, 'Mirage              '),
 (10790, 'Caltabiano          '),
 (10040, 'Fracalanza          '),
 (10310, 'Lian                '),
 (10080, 'Self Car            '),
 (10420, 'Cavox               '),
 (10180, 'Libra               ')]

## 5. Quais são os automóveis no banco de dados, com valor tabelado superior a 120 mil reais, que ainda não foram comprados por consumidor algum?

In [ ]:
%%sql

SELECT Codigo, Fabricante, Modelo
FROM Automoveis
WHERE Preco_tabela > 120000
AND (Codigo, Ano) NOT IN
(SELECT Codigo, Ano FROM Negocios)

 * postgresql://postgres:***@localhost:5432/postgres
7 rows affected.

[(1181, 'Porsche             ', '938 GTS             '),
 (1201, 'Ferrari             ', '512                 '),
 (1241, 'Rolls Royce         ', 'Corniche            '),
 (1154, 'BMW                 ', '840                 '),
 (1202, 'Ferrari             ', '348                 '),
 (1182, 'Porsche             ', '921 Carrera         '),
 (1194, 'Mercedes Benz       ', 'S500                ')]

## 6. Quais revendedoras (CGC) têm para vender automóveis dos anos 88 e 89?.

In [ ]:
%%sql

SELECT DISTINCT CGC
FROM Garagens
WHERE Ano IN ('88', '89')
ORDER BY CGC

 * postgresql://postgres:***@localhost:5432/postgres
6 rows affected.

[(10030,), (10200,), (10310,), (10780,), (10930,), (10980,)]